Revit 2027 API
GlobalParameterFailures Properties
The BuiltInFailures.GlobalParameterFailures type exposes the following members.
Properties
Name | Description
ElementPropLinkCircularChain |  Linked properties in highlighted elements cause a circular chain of references.
ElementPropLinkCircularChainError |  Linked properties in highlighted elements cause a circular chain of references.
GlobalParamFormulaCircularChain |  A formula in a global parameter causes a circular chain of references between highlighted elements.
GlobalParamFormulaCircularChainError |  A formula in a global parameter causes a circular chain of references between highlighted elements.
GlobalParamInvalidElemParamValue |  Invalid value of parameter %1!s! in highlighted element.
InvalidElementPropToGlobalParamLink |  The following parameters of the highlighted element can no longer be linked to global parameters: %1!s!.
Top
See Also
Reference
BuiltInFailures.GlobalParameterFailures Class
Autodesk.Revit.DB Namespace